Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM202.h
extern volatile CLC2SELBITS CLC2SELbits __attribute__((__sfr__));

#define CLC2SELL CLC2SELL
extern volatile unsigned int  CLC2SELL __attribute__((__sfr__));
__extension__ typedef struct tagCLC2SELLBITS {
  union {
    struct {
      unsigned DS1:3;
      unsigned :1;
      unsigned DS2:3;
      unsigned :1;
      unsigned DS3:3;
      unsigned :1;
      unsigned DS4:3;
    };
    struct {
      unsigned DS10:1;
      unsigned DS11:1;
      unsigned DS12:1;
      unsigned :1;
      unsigned DS20:1;
      unsigned DS21:1;
      unsigned DS22:1;
      unsigned :1;
      unsigned DS30:1;
      unsigned DS31:1;
      unsigned DS32:1;
      unsigned :1;
      unsigned DS40:1;
      unsigned DS41:1;
      unsigned DS42:1;
    };
  };
} CLC2SELLBITS;
extern volatile CLC2SELLBITS CLC2SELLbits __attribute__((__sfr__));

#define CLC2GLSL CLC2GLSL
extern volatile unsigned int  CLC2GLSL __attribute__((__sfr__));
typedef struct tagCLC2GLSLBITS {
  unsigned G1D1N:1;
  unsigned G1D1T:1;
  unsigned G1D2N:1;
  unsigned G1D2T:1;
  unsigned G1D3N:1;
  unsigned G1D3T:1;
  unsigned G1D4N:1;
  unsigned G1D4T:1;
  unsigned G2D1N:1;
  unsigned G2D1T:1;
  unsigned G2D2N:1;
  unsigned G2D2T:1;
  unsigned G2D3N:1;
  unsigned G2D3T:1;
  unsigned G2D4N:1;
  unsigned G2D4T:1;
} CLC2GLSLBITS;
extern volatile CLC2GLSLBITS CLC2GLSLbits __attribute__((__sfr__));

#define CLC2GLSH CLC2GLSH
extern volatile unsigned int  CLC2GLSH __attribute__((__sfr__));
typedef struct tagCLC2GLSHBITS {
  unsigned G3D1N:1;
  unsigned G3D1T:1;
  unsigned G3D2N:1;
  unsigned G3D2T:1;
  unsigned G3D3N:1;
  unsigned G3D3T:1;
  unsigned G3D4N:1;
  unsigned G3D4T:1;
  unsigned G4D1N:1;
  unsigned G4D1T:1;
  unsigned G4D2N:1;
  unsigned G4D2T:1;
  unsigned G4D3N:1;
  unsigned G4D3T:1;
  unsigned G4D4N:1;
  unsigned G4D4T:1;
} CLC2GLSHBITS;
extern volatile CLC2GLSHBITS CLC2GLSHbits __attribute__((__sfr__));

#define CCP1CON1L CCP1CON1L
extern volatile unsigned int  CCP1CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON1LBITS {
  union {
    struct {
      unsigned MOD:4;
      unsigned CCSEL:1;
      unsigned T32:1;
      unsigned TMRPS:2;
      unsigned CLKSEL:3;
      unsigned TMRSYNC:1;
      unsigned CCPSLP:1;
      unsigned CCPSIDL:1;
      unsigned :1;
      unsigned CCPON:1;
    };
    struct {
      unsigned MOD0:1;
      unsigned MOD1:1;
      unsigned MOD2:1;
      unsigned MOD3:1;
      unsigned :1;
      unsigned TMR32:1;
      unsigned TMRPS0:1;
      unsigned TMRPS1:1;
      unsigned CLKSEL0:1;
      unsigned CLKSEL1:1;
      unsigned CLKSEL2:1;
    };
    struct {
      unsigned CCPMOD:4;
    };
    struct {
      unsigned CCPMOD0:1;
      unsigned CCPMOD1:1;
      unsigned CCPMOD2:1;
      unsigned CCPMOD3:1;
    };
  };
} CCP1CON1LBITS;
extern volatile CCP1CON1LBITS CCP1CON1Lbits __attribute__((__sfr__));

#define CCP1CON1H CCP1CON1H
extern volatile unsigned int  CCP1CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON1HBITS {
  union {
    struct {
      unsigned SYNC:5;
      unsigned ALTSYNC:1;
      unsigned ONESHOT:1;
      unsigned TRIGEN:1;
      unsigned OPS:4;
      unsigned :2;
      unsigned RTRGEN:1;
      unsigned OPSSRC:1;
    };
    struct {
      unsigned SYNC0:1;
      unsigned SYNC1:1;
      unsigned SYNC2:1;
      unsigned SYNC3:1;
      unsigned SYNC4:1;
      unsigned :3;
      unsigned OPS0:1;
      unsigned OPS1:1;
      unsigned OPS2:1;
      unsigned OPS3:1;
      unsigned :3;
      unsigned OPSRC:1;
    };
    struct {
      unsigned :8;
      unsigned IOPS:4;
    };
    struct {
      unsigned :8;
      unsigned IOPS0:1;
      unsigned IOPS1:1;
      unsigned IOPS2:1;
      unsigned IOPS3:1;
    };
  };
} CCP1CON1HBITS;
extern volatile CCP1CON1HBITS CCP1CON1Hbits __attribute__((__sfr__));

#define CCP1CON2L CCP1CON2L
extern volatile unsigned int  CCP1CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON2LBITS {
  union {
    struct {
      unsigned ASDG:8;
      unsigned :4;
      unsigned SSDG:1;
      unsigned :1;
      unsigned ASDGM:1;
      unsigned PWMRSEN:1;
    };
    struct {
      unsigned ASDG0:1;
      unsigned ASDG1:1;
      unsigned ASDG2:1;
      unsigned ASDG3:1;
      unsigned ASDG4:1;
      unsigned ASDG5:1;
      unsigned ASDG6:1;
      unsigned ASDG7:1;
    };
  };
} CCP1CON2LBITS;
extern volatile CCP1CON2LBITS CCP1CON2Lbits __attribute__((__sfr__));

#define CCP1CON2H CCP1CON2H
extern volatile unsigned int  CCP1CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON2HBITS {
  union {
    struct {
      unsigned ICS:3;
      unsigned AUXOUT:2;
      unsigned :1;
      unsigned ICGSM:2;
      unsigned OCAEN:1;
      unsigned OCBEN:1;
      unsigned OCCEN:1;
      unsigned OCDEN:1;
      unsigned OCEEN:1;
      unsigned OCFEN:1;
      unsigned :1;
      unsigned OENSYNC:1;
    };
    struct {
      unsigned ICS0:1;
      unsigned ICS1:1;
      unsigned ICS2:1;
      unsigned AUXOUT0:1;
      unsigned AUXOUT1:1;
      unsigned :1;
      unsigned ICGSM0:1;
      unsigned ICGSM1:1;
    };
    struct {
      unsigned ICSEL:3;
    };
    struct {
      unsigned ICSEL0:1;
      unsigned ICSEL1:1;
      unsigned ICSEL2:1;
    };
  };
} CCP1CON2HBITS;
extern volatile CCP1CON2HBITS CCP1CON2Hbits __attribute__((__sfr__));

#define CCP1CON3L CCP1CON3L
extern volatile unsigned int  CCP1CON3L __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON3LBITS {
  union {
    struct {
      unsigned DT:6;
    };
    struct {
      unsigned DT0:1;
      unsigned DT1:1;
      unsigned DT2:1;
      unsigned DT3:1;
      unsigned DT4:1;
      unsigned DT5:1;
    };
  };
} CCP1CON3LBITS;
extern volatile CCP1CON3LBITS CCP1CON3Lbits __attribute__((__sfr__));

#define CCP1CON3H CCP1CON3H
extern volatile unsigned int  CCP1CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON3HBITS {
  union {
    struct {
      unsigned PSSBDF:2;
      unsigned PSSACE:2;
      unsigned POLBDF:1;
      unsigned POLACE:1;
      unsigned :2;
      unsigned OUTM:3;
      unsigned :1;
      unsigned OSCNT:3;
      unsigned OETRIG:1;
    };
    struct {
      unsigned PSSBDF0:1;
      unsigned PSSBDF1:1;
      unsigned PSSACE0:1;
      unsigned PSSACE1:1;
      unsigned :4;
      unsigned OUTM0:1;
      unsigned OUTM1:1;
      unsigned OUTM2:1;
      unsigned :1;
      unsigned OSCNT0:1;
      unsigned OSCNT1:1;
      unsigned OSCNT2:1;
    };
  };
} CCP1CON3HBITS;
extern volatile CCP1CON3HBITS CCP1CON3Hbits __attribute__((__sfr__));

#define CCP1STAT CCP1STAT
extern volatile unsigned int  CCP1STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP1STATBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP1STATBITS;
extern volatile CCP1STATBITS CCP1STATbits __attribute__((__sfr__));

#define CCP1STATL CCP1STATL
extern volatile unsigned int  CCP1STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP1STATLBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP1STATLBITS;
extern volatile CCP1STATLBITS CCP1STATLbits __attribute__((__sfr__));

#define CCP1TMRL CCP1TMRL
extern volatile unsigned int  CCP1TMRL __attribute__((__sfr__));
#define CCP1TMRH CCP1TMRH
extern volatile unsigned int  CCP1TMRH __attribute__((__sfr__));
#define CCP1PRL CCP1PRL
extern volatile unsigned int  CCP1PRL __attribute__((__sfr__));
#define CCP1PRH CCP1PRH
extern volatile unsigned int  CCP1PRH __attribute__((__sfr__));
#define CCP1RA CCP1RA
extern volatile unsigned int  CCP1RA __attribute__((__sfr__));
#define CCP1RAL CCP1RAL
extern volatile unsigned int  CCP1RAL __attribute__((__sfr__));
#define CCP1RB CCP1RB
extern volatile unsigned int  CCP1RB __attribute__((__sfr__));
#define CCP1RBL CCP1RBL
extern volatile unsigned int  CCP1RBL __attribute__((__sfr__));
#define CCP1BUFL CCP1BUFL
extern volatile unsigned int  CCP1BUFL __attribute__((__sfr__));
#define CCP1BUFH CCP1BUFH
extern volatile unsigned int  CCP1BUFH __attribute__((__sfr__));
#define CCP2CON1L CCP2CON1L
extern volatile unsigned int  CCP2CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CON1LBITS {
  union {
    struct {
      unsigned MOD:4;
      unsigned CCSEL:1;
      unsigned T32:1;
      unsigned TMRPS:2;
      unsigned CLKSEL:3;
      unsigned TMRSYNC:1;
      unsigned CCPSLP:1;
      unsigned CCPSIDL:1;
      unsigned :1;
      unsigned CCPON:1;
    };
    struct {
      unsigned MOD0:1;
      unsigned MOD1:1;
      unsigned MOD2:1;
      unsigned MOD3:1;
      unsigned :1;
      unsigned TMR32:1;
      unsigned TMRPS0:1;
      unsigned TMRPS1:1;
      unsigned CLKSEL0:1;
      unsigned CLKSEL1:1;
      unsigned CLKSEL2:1;
    };
    struct {
      unsigned CCPMOD:4;
    };
    struct {
      unsigned CCPMOD0:1;
      unsigned CCPMOD1:1;
      unsigned CCPMOD2:1;
      unsigned CCPMOD3:1;
    };
  };
} CCP2CON1LBITS;
extern volatile CCP2CON1LBITS CCP2CON1Lbits __attribute__((__sfr__));

#define CCP2CON1H CCP2CON1H
extern volatile unsigned int  CCP2CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CON1HBITS {
  union {
    struct {
      unsigned SYNC:5;
      unsigned ALTSYNC:1;
      unsigned ONESHOT:1;
      unsigned TRIGEN:1;
      unsigned OPS:4;
      unsigned :2;
      unsigned RTRGEN:1;
      unsigned OPSSRC:1;
    };
    struct {
      unsigned SYNC0:1;
      unsigned SYNC1:1;
      unsigned SYNC2:1;
      unsigned SYNC3:1;
      unsigned SYNC4:1;
      unsigned :3;
      unsigned OPS0:1;
      unsigned OPS1:1;
      unsigned OPS2:1;
      unsigned OPS3:1;
      unsigned :3;
      unsigned OPSRC:1;
    };
    struct {
      unsigned :8;
      unsigned IOPS:4;
    };
    struct {
      unsigned :8;
      unsigned IOPS0:1;
      unsigned IOPS1:1;
      unsigned IOPS2:1;
      unsigned IOPS3:1;
    };
  };
} CCP2CON1HBITS;
extern volatile CCP2CON1HBITS CCP2CON1Hbits __attribute__((__sfr__));

#define CCP2CON2L CCP2CON2L
extern volatile unsigned int  CCP2CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CON2LBITS {
  union {
    struct {
      unsigned ASDG:8;
      unsigned :4;
      unsigned SSDG:1;
      unsigned :1;
      unsigned ASDGM:1;
      unsigned PWMRSEN:1;
    };
    struct {
      unsigned ASDG0:1;
      unsigned ASDG1:1;
      unsigned ASDG2:1;
      unsigned ASDG3:1;
      unsigned ASDG4:1;
      unsigned ASDG5:1;
      unsigned ASDG6:1;
      unsigned ASDG7:1;
    };
  };
} CCP2CON2LBITS;
