Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM202.h
extern volatile CCP4CON2LBITS CCP4CON2Lbits __attribute__((__sfr__));

#define CCP4CON2H CCP4CON2H
extern volatile unsigned int  CCP4CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON2HBITS {
  union {
    struct {
      unsigned ICS:3;
      unsigned AUXOUT:2;
      unsigned :1;
      unsigned ICGSM:2;
      unsigned OCAEN:1;
      unsigned :6;
      unsigned OENSYNC:1;
    };
    struct {
      unsigned ICS0:1;
      unsigned ICS1:1;
      unsigned ICS2:1;
      unsigned AUXOUT0:1;
      unsigned AUXOUT1:1;
      unsigned :1;
      unsigned ICGSM0:1;
      unsigned ICGSM1:1;
    };
    struct {
      unsigned ICSEL:3;
    };
    struct {
      unsigned ICSEL0:1;
      unsigned ICSEL1:1;
      unsigned ICSEL2:1;
    };
  };
} CCP4CON2HBITS;
extern volatile CCP4CON2HBITS CCP4CON2Hbits __attribute__((__sfr__));

#define CCP4CON3H CCP4CON3H
extern volatile unsigned int  CCP4CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON3HBITS {
  union {
    struct {
      unsigned :2;
      unsigned PSSACE:2;
      unsigned :1;
      unsigned POLACE:1;
      unsigned :6;
      unsigned OSCNT:3;
      unsigned OETRIG:1;
    };
    struct {
      unsigned :2;
      unsigned PSSACE0:1;
      unsigned PSSACE1:1;
      unsigned :8;
      unsigned OSCNT0:1;
      unsigned OSCNT1:1;
      unsigned OSCNT2:1;
    };
  };
} CCP4CON3HBITS;
extern volatile CCP4CON3HBITS CCP4CON3Hbits __attribute__((__sfr__));

#define CCP4STAT CCP4STAT
extern volatile unsigned int  CCP4STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP4STATBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP4STATBITS;
extern volatile CCP4STATBITS CCP4STATbits __attribute__((__sfr__));

#define CCP4STATL CCP4STATL
extern volatile unsigned int  CCP4STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP4STATLBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP4STATLBITS;
extern volatile CCP4STATLBITS CCP4STATLbits __attribute__((__sfr__));

#define CCP4TMRL CCP4TMRL
extern volatile unsigned int  CCP4TMRL __attribute__((__sfr__));
#define CCP4TMRH CCP4TMRH
extern volatile unsigned int  CCP4TMRH __attribute__((__sfr__));
#define CCP4PRL CCP4PRL
extern volatile unsigned int  CCP4PRL __attribute__((__sfr__));
#define CCP4PRH CCP4PRH
extern volatile unsigned int  CCP4PRH __attribute__((__sfr__));
#define CCP4RA CCP4RA
extern volatile unsigned int  CCP4RA __attribute__((__sfr__));
#define CCP4RAL CCP4RAL
extern volatile unsigned int  CCP4RAL __attribute__((__sfr__));
#define CCP4RB CCP4RB
extern volatile unsigned int  CCP4RB __attribute__((__sfr__));
#define CCP4RBL CCP4RBL
extern volatile unsigned int  CCP4RBL __attribute__((__sfr__));
#define CCP4BUFL CCP4BUFL
extern volatile unsigned int  CCP4BUFL __attribute__((__sfr__));
#define CCP4BUFH CCP4BUFH
extern volatile unsigned int  CCP4BUFH __attribute__((__sfr__));
#define CCP5CON1L CCP5CON1L
extern volatile unsigned int  CCP5CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON1LBITS {
  union {
    struct {
      unsigned MOD:4;
      unsigned CCSEL:1;
      unsigned T32:1;
      unsigned TMRPS:2;
      unsigned CLKSEL:3;
      unsigned TMRSYNC:1;
      unsigned CCPSLP:1;
      unsigned CCPSIDL:1;
      unsigned :1;
      unsigned CCPON:1;
    };
    struct {
      unsigned MOD0:1;
      unsigned MOD1:1;
      unsigned MOD2:1;
      unsigned MOD3:1;
      unsigned :1;
      unsigned TMR32:1;
      unsigned TMRPS0:1;
      unsigned TMRPS1:1;
      unsigned CLKSEL0:1;
      unsigned CLKSEL1:1;
      unsigned CLKSEL2:1;
    };
    struct {
      unsigned CCPMOD:4;
    };
    struct {
      unsigned CCPMOD0:1;
      unsigned CCPMOD1:1;
      unsigned CCPMOD2:1;
      unsigned CCPMOD3:1;
    };
  };
} CCP5CON1LBITS;
extern volatile CCP5CON1LBITS CCP5CON1Lbits __attribute__((__sfr__));

#define CCP5CON1H CCP5CON1H
extern volatile unsigned int  CCP5CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON1HBITS {
  union {
    struct {
      unsigned SYNC:5;
      unsigned ALTSYNC:1;
      unsigned ONESHOT:1;
      unsigned TRIGEN:1;
      unsigned OPS:4;
      unsigned :2;
      unsigned RTRGEN:1;
      unsigned OPSSRC:1;
    };
    struct {
      unsigned SYNC0:1;
      unsigned SYNC1:1;
      unsigned SYNC2:1;
      unsigned SYNC3:1;
      unsigned SYNC4:1;
      unsigned :3;
      unsigned OPS0:1;
      unsigned OPS1:1;
      unsigned OPS2:1;
      unsigned OPS3:1;
      unsigned :3;
      unsigned OPSRC:1;
    };
    struct {
      unsigned :8;
      unsigned IOPS:4;
    };
    struct {
      unsigned :8;
      unsigned IOPS0:1;
      unsigned IOPS1:1;
      unsigned IOPS2:1;
      unsigned IOPS3:1;
    };
  };
} CCP5CON1HBITS;
extern volatile CCP5CON1HBITS CCP5CON1Hbits __attribute__((__sfr__));

#define CCP5CON2L CCP5CON2L
extern volatile unsigned int  CCP5CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON2LBITS {
  union {
    struct {
      unsigned ASDG:8;
      unsigned :4;
      unsigned SSDG:1;
      unsigned :1;
      unsigned ASDGM:1;
      unsigned PWMRSEN:1;
    };
    struct {
      unsigned ASDG0:1;
      unsigned ASDG1:1;
      unsigned ASDG2:1;
      unsigned ASDG3:1;
      unsigned ASDG4:1;
      unsigned ASDG5:1;
      unsigned ASDG6:1;
      unsigned ASDG7:1;
    };
  };
} CCP5CON2LBITS;
extern volatile CCP5CON2LBITS CCP5CON2Lbits __attribute__((__sfr__));

#define CCP5CON2H CCP5CON2H
extern volatile unsigned int  CCP5CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON2HBITS {
  union {
    struct {
      unsigned ICS:3;
      unsigned AUXOUT:2;
      unsigned :1;
      unsigned ICGSM:2;
      unsigned OCAEN:1;
      unsigned :6;
      unsigned OENSYNC:1;
    };
    struct {
      unsigned ICS0:1;
      unsigned ICS1:1;
      unsigned ICS2:1;
      unsigned AUXOUT0:1;
      unsigned AUXOUT1:1;
      unsigned :1;
      unsigned ICGSM0:1;
      unsigned ICGSM1:1;
    };
    struct {
      unsigned ICSEL:3;
    };
    struct {
      unsigned ICSEL0:1;
      unsigned ICSEL1:1;
      unsigned ICSEL2:1;
    };
  };
} CCP5CON2HBITS;
extern volatile CCP5CON2HBITS CCP5CON2Hbits __attribute__((__sfr__));

#define CCP5CON3H CCP5CON3H
extern volatile unsigned int  CCP5CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON3HBITS {
  union {
    struct {
      unsigned :2;
      unsigned PSSACE:2;
      unsigned :1;
      unsigned POLACE:1;
      unsigned :6;
      unsigned OSCNT:3;
      unsigned OETRIG:1;
    };
    struct {
      unsigned :2;
      unsigned PSSACE0:1;
      unsigned PSSACE1:1;
      unsigned :8;
      unsigned OSCNT0:1;
      unsigned OSCNT1:1;
      unsigned OSCNT2:1;
    };
  };
} CCP5CON3HBITS;
extern volatile CCP5CON3HBITS CCP5CON3Hbits __attribute__((__sfr__));

#define CCP5STAT CCP5STAT
extern volatile unsigned int  CCP5STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP5STATBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP5STATBITS;
