Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM202.h
#define U2STA U2STA
extern volatile unsigned int  U2STA __attribute__((__sfr__));
__extension__ typedef struct tagU2STABITS {
  union {
    struct {
      unsigned URXDA:1;
      unsigned OERR:1;
      unsigned FERR:1;
      unsigned PERR:1;
      unsigned RIDLE:1;
      unsigned ADDEN:1;
      unsigned URXISEL:2;
      unsigned TRMT:1;
      unsigned UTXBF:1;
      unsigned UTXEN:1;
      unsigned UTXBRK:1;
      unsigned :1;
      unsigned UTXISEL0:1;
      unsigned UTXINV:1;
      unsigned UTXISEL1:1;
    };
    struct {
      unsigned :6;
      unsigned URXISEL0:1;
      unsigned URXISEL1:1;
      unsigned :6;
      unsigned TXINV:1;
    };
  };
} U2STABITS;
extern volatile U2STABITS U2STAbits __attribute__((__sfr__));

#define U2TXREG U2TXREG
extern volatile unsigned int  U2TXREG __attribute__((__sfr__));
#define U2RXREG U2RXREG
extern volatile unsigned int  U2RXREG __attribute__((__sfr__));
#define U2BRG U2BRG
extern volatile unsigned int  U2BRG __attribute__((__sfr__));
#define AMP1CON AMP1CON
extern volatile unsigned int  AMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagAMP1CONBITS {
  union {
    struct {
      unsigned PINSEL:3;
      unsigned NINSEL:3;
      unsigned :1;
      unsigned SPDSEL:1;
      unsigned :4;
      unsigned AMPSLP:1;
      unsigned AMPSIDL:1;
      unsigned :1;
      unsigned AMPEN:1;
    };
    struct {
      unsigned PINSEL0:1;
      unsigned PINSEL1:1;
      unsigned PINSEL2:1;
      unsigned NINSEL0:1;
      unsigned NINSEL1:1;
      unsigned NINSEL2:1;
    };
  };
} AMP1CONBITS;
extern volatile AMP1CONBITS AMP1CONbits __attribute__((__sfr__));

#define AMP2CON AMP2CON
extern volatile unsigned int  AMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagAMP2CONBITS {
  union {
    struct {
      unsigned PINSEL:3;
      unsigned NINSEL:3;
      unsigned :1;
      unsigned SPDSEL:1;
      unsigned :4;
      unsigned AMPSLP:1;
      unsigned AMPSIDL:1;
      unsigned :1;
      unsigned AMPEN:1;
    };
    struct {
      unsigned PINSEL0:1;
      unsigned PINSEL1:1;
      unsigned PINSEL2:1;
      unsigned NINSEL0:1;
      unsigned NINSEL1:1;
      unsigned NINSEL2:1;
    };
  };
} AMP2CONBITS;
extern volatile AMP2CONBITS AMP2CONbits __attribute__((__sfr__));

#define DAC1CON DAC1CON
extern volatile unsigned int  DAC1CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONBITS {
  union {
    struct {
      unsigned DACREF:2;
      unsigned DACTSEL:5;
      unsigned DACOE:1;
      unsigned DACTRIG:1;
      unsigned SRDIS:1;
      unsigned :1;
      unsigned DACFM:1;
      unsigned DACSLP:1;
      unsigned DACSIDL:1;
      unsigned :1;
      unsigned DACEN:1;
    };
    struct {
      unsigned REFSEL0:1;
      unsigned REFSEL1:1;
      unsigned DACTSEL0:1;
      unsigned DACTSEL1:1;
      unsigned DACTSEL2:1;
      unsigned DACTSEL3:1;
      unsigned DACTSEL4:1;
    };
  };
} DAC1CONBITS;
extern volatile DAC1CONBITS DAC1CONbits __attribute__((__sfr__));

#define DAC1DAT DAC1DAT
extern volatile unsigned int  DAC1DAT __attribute__((__sfr__));
#define DAC2CON DAC2CON
extern volatile unsigned int  DAC2CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONBITS {
  union {
    struct {
      unsigned DACREF:2;
      unsigned DACTSEL:5;
      unsigned DACOE:1;
      unsigned DACTRIG:1;
      unsigned SRDIS:1;
      unsigned :1;
      unsigned DACFM:1;
      unsigned DACSLP:1;
      unsigned DACSIDL:1;
      unsigned :1;
      unsigned DACEN:1;
    };
    struct {
      unsigned REFSEL0:1;
      unsigned REFSEL1:1;
      unsigned DACTSEL0:1;
      unsigned DACTSEL1:1;
      unsigned DACTSEL2:1;
      unsigned DACTSEL3:1;
      unsigned DACTSEL4:1;
    };
  };
} DAC2CONBITS;
extern volatile DAC2CONBITS DAC2CONbits __attribute__((__sfr__));

#define DAC2DAT DAC2DAT
extern volatile unsigned int  DAC2DAT __attribute__((__sfr__));
#define TRISA TRISA
extern volatile unsigned int  TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  unsigned TRISA0:1;
  unsigned TRISA1:1;
  unsigned TRISA2:1;
  unsigned TRISA3:1;
  unsigned TRISA4:1;
  unsigned :1;
  unsigned TRISA6:1;
  unsigned TRISA7:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile unsigned int  PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  unsigned RA0:1;
  unsigned RA1:1;
  unsigned RA2:1;
  unsigned RA3:1;
  unsigned RA4:1;
  unsigned RA5:1;
  unsigned RA6:1;
  unsigned RA7:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile unsigned int  LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  unsigned LATA0:1;
  unsigned LATA1:1;
  unsigned LATA2:1;
  unsigned LATA3:1;
  unsigned LATA4:1;
  unsigned :1;
  unsigned LATA6:1;
  unsigned LATA7:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile unsigned int  ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  unsigned ODA0:1;
  unsigned ODA1:1;
  unsigned ODA2:1;
  unsigned ODA3:1;
  unsigned ODA4:1;
  unsigned :1;
  unsigned ODA6:1;
  unsigned ODA7:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define TRISB TRISB
extern volatile unsigned int  TRISB __attribute__((__sfr__));
typedef struct tagTRISBBITS {
  unsigned TRISB0:1;
  unsigned TRISB1:1;
  unsigned TRISB2:1;
  unsigned TRISB3:1;
  unsigned TRISB4:1;
  unsigned TRISB5:1;
  unsigned TRISB6:1;
  unsigned TRISB7:1;
  unsigned TRISB8:1;
  unsigned TRISB9:1;
  unsigned TRISB10:1;
  unsigned TRISB11:1;
  unsigned TRISB12:1;
  unsigned TRISB13:1;
  unsigned TRISB14:1;
  unsigned TRISB15:1;
} TRISBBITS;
extern volatile TRISBBITS TRISBbits __attribute__((__sfr__));

#define PORTB PORTB
extern volatile unsigned int  PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  unsigned RB0:1;
  unsigned RB1:1;
  unsigned RB2:1;
  unsigned RB3:1;
  unsigned RB4:1;
  unsigned RB5:1;
  unsigned RB6:1;
  unsigned RB7:1;
  unsigned RB8:1;
  unsigned RB9:1;
  unsigned RB10:1;
  unsigned RB11:1;
  unsigned RB12:1;
  unsigned RB13:1;
  unsigned RB14:1;
  unsigned RB15:1;
} PORTBBITS;
