Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM202.h
/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TECS T1CONbits.TECS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1
#define _T1ECS0 T1CONbits.T1ECS0
#define _T1ECS1 T1CONbits.T1ECS1
#define _T1ECS T1CONbits.T1ECS
#define _TECS0 T1CONbits.TECS0
#define _TECS1 T1CONbits.TECS1
#define _TIECS T1CONbits.TIECS
#define _TIECS0 T1CONbits.TIECS0
#define _TIECS1 T1CONbits.TIECS1

/* CLC1CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC1CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC1SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC1GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

/* CLC1GLSH */
/* Bitname _G3D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4T cannot be defined because it is used by more than one SFR */

/* CLC2CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC2CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC2SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC2SELL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC2GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

