Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM202.h
/* U1MODE */
#define _STSEL U1MODEbits.STSEL
#define _PDSEL U1MODEbits.PDSEL
#define _BRGH U1MODEbits.BRGH
#define _URXINV U1MODEbits.URXINV
#define _ABAUD U1MODEbits.ABAUD
#define _LPBACK U1MODEbits.LPBACK
#define _WAKE U1MODEbits.WAKE
#define _UEN U1MODEbits.UEN
#define _RTSMD U1MODEbits.RTSMD
#define _IREN U1MODEbits.IREN
#define _USIDL U1MODEbits.USIDL
#define _UARTEN U1MODEbits.UARTEN
#define _PDSEL0 U1MODEbits.PDSEL0
#define _PDSEL1 U1MODEbits.PDSEL1
#define _RXINV U1MODEbits.RXINV
#define _UEN0 U1MODEbits.UEN0
#define _UEN1 U1MODEbits.UEN1

/* U1STA */
#define _URXDA U1STAbits.URXDA
#define _OERR U1STAbits.OERR
#define _FERR U1STAbits.FERR
#define _PERR U1STAbits.PERR
#define _RIDLE U1STAbits.RIDLE
#define _ADDEN U1STAbits.ADDEN
#define _URXISEL U1STAbits.URXISEL
#define _TRMT U1STAbits.TRMT
#define _UTXBF U1STAbits.UTXBF
#define _UTXEN U1STAbits.UTXEN
#define _UTXBRK U1STAbits.UTXBRK
#define _UTXISEL0 U1STAbits.UTXISEL0
#define _UTXINV U1STAbits.UTXINV
#define _UTXISEL1 U1STAbits.UTXISEL1
#define _URXISEL0 U1STAbits.URXISEL0
#define _URXISEL1 U1STAbits.URXISEL1
#define _TXINV U1STAbits.TXINV

/* U2MODE */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _LPBACK cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _UEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTSMD cannot be defined because it is used by more than one SFR */
/* Bitname _IREN cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _UEN1 cannot be defined because it is used by more than one SFR */

/* U2STA */
/* Bitname _URXDA cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _ADDEN cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXINV cannot be defined because it is used by more than one SFR */

/* AMP1CON */
/* Bitname _PINSEL cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SPDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _AMPSLP cannot be defined because it is used by more than one SFR */
/* Bitname _AMPSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _AMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PINSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PINSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _PINSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL2 cannot be defined because it is used by more than one SFR */

/* AMP2CON */
/* Bitname _PINSEL cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SPDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _AMPSLP cannot be defined because it is used by more than one SFR */
/* Bitname _AMPSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _AMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PINSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PINSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _PINSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _NINSEL2 cannot be defined because it is used by more than one SFR */

/* DAC1CON */
/* Bitname _DACREF cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _DACOE cannot be defined because it is used by more than one SFR */
/* Bitname _DACTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _SRDIS cannot be defined because it is used by more than one SFR */
/* Bitname _DACFM cannot be defined because it is used by more than one SFR */
/* Bitname _DACSLP cannot be defined because it is used by more than one SFR */
/* Bitname _DACSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL4 cannot be defined because it is used by more than one SFR */

/* DAC2CON */
/* Bitname _DACREF cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _DACOE cannot be defined because it is used by more than one SFR */
/* Bitname _DACTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _SRDIS cannot be defined because it is used by more than one SFR */
/* Bitname _DACFM cannot be defined because it is used by more than one SFR */
/* Bitname _DACSLP cannot be defined because it is used by more than one SFR */
/* Bitname _DACSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL4 cannot be defined because it is used by more than one SFR */

/* TRISA */
#define _TRISA0 TRISAbits.TRISA0
#define _TRISA1 TRISAbits.TRISA1
#define _TRISA2 TRISAbits.TRISA2
#define _TRISA3 TRISAbits.TRISA3
#define _TRISA4 TRISAbits.TRISA4
#define _TRISA6 TRISAbits.TRISA6
#define _TRISA7 TRISAbits.TRISA7

/* PORTA */
#define _RA0 PORTAbits.RA0
#define _RA1 PORTAbits.RA1
#define _RA2 PORTAbits.RA2
#define _RA3 PORTAbits.RA3
#define _RA4 PORTAbits.RA4
#define _RA5 PORTAbits.RA5
#define _RA6 PORTAbits.RA6
#define _RA7 PORTAbits.RA7

/* LATA */
#define _LATA0 LATAbits.LATA0
#define _LATA1 LATAbits.LATA1
#define _LATA2 LATAbits.LATA2
#define _LATA3 LATAbits.LATA3
#define _LATA4 LATAbits.LATA4
#define _LATA6 LATAbits.LATA6
#define _LATA7 LATAbits.LATA7

/* ODCA */
#define _ODA0 ODCAbits.ODA0
#define _ODA1 ODCAbits.ODA1
#define _ODA2 ODCAbits.ODA2
#define _ODA3 ODCAbits.ODA3
#define _ODA4 ODCAbits.ODA4
#define _ODA6 ODCAbits.ODA6
#define _ODA7 ODCAbits.ODA7

/* TRISB */
#define _TRISB0 TRISBbits.TRISB0
#define _TRISB1 TRISBbits.TRISB1
#define _TRISB2 TRISBbits.TRISB2
#define _TRISB3 TRISBbits.TRISB3
#define _TRISB4 TRISBbits.TRISB4
#define _TRISB5 TRISBbits.TRISB5
#define _TRISB6 TRISBbits.TRISB6
#define _TRISB7 TRISBbits.TRISB7
#define _TRISB8 TRISBbits.TRISB8
#define _TRISB9 TRISBbits.TRISB9
#define _TRISB10 TRISBbits.TRISB10
#define _TRISB11 TRISBbits.TRISB11
#define _TRISB12 TRISBbits.TRISB12
#define _TRISB13 TRISBbits.TRISB13
#define _TRISB14 TRISBbits.TRISB14
#define _TRISB15 TRISBbits.TRISB15

/* PORTB */
#define _RB0 PORTBbits.RB0
#define _RB1 PORTBbits.RB1
#define _RB2 PORTBbits.RB2
#define _RB3 PORTBbits.RB3
#define _RB4 PORTBbits.RB4
#define _RB5 PORTBbits.RB5
#define _RB6 PORTBbits.RB6
#define _RB7 PORTBbits.RB7
#define _RB8 PORTBbits.RB8
#define _RB9 PORTBbits.RB9
#define _RB10 PORTBbits.RB10
#define _RB11 PORTBbits.RB11
#define _RB12 PORTBbits.RB12
#define _RB13 PORTBbits.RB13
#define _RB14 PORTBbits.RB14
#define _RB15 PORTBbits.RB15

