Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM202.h
#define _INTCON2_INT0EP_POSITION                 0x00000000
#define _INTCON2_INT0EP_MASK                     0x00000001
#define _INTCON2_INT0EP_LENGTH                   0x00000001

#define _INTCON2_INT1EP_POSITION                 0x00000001
#define _INTCON2_INT1EP_MASK                     0x00000002
#define _INTCON2_INT1EP_LENGTH                   0x00000001

#define _INTCON2_INT2EP_POSITION                 0x00000002
#define _INTCON2_INT2EP_MASK                     0x00000004
#define _INTCON2_INT2EP_LENGTH                   0x00000001

#define _INTCON2_DISI_POSITION                   0x0000000E
#define _INTCON2_DISI_MASK                       0x00004000
#define _INTCON2_DISI_LENGTH                     0x00000001

#define _INTCON2_ALTIVT_POSITION                 0x0000000F
#define _INTCON2_ALTIVT_MASK                     0x00008000
#define _INTCON2_ALTIVT_LENGTH                   0x00000001

#define _IFS0_INT0IF_POSITION                    0x00000000
#define _IFS0_INT0IF_MASK                        0x00000001
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_CCP1IF_POSITION                    0x00000001
#define _IFS0_CCP1IF_MASK                        0x00000002
#define _IFS0_CCP1IF_LENGTH                      0x00000001

#define _IFS0_CCP2IF_POSITION                    0x00000002
#define _IFS0_CCP2IF_MASK                        0x00000004
#define _IFS0_CCP2IF_LENGTH                      0x00000001

#define _IFS0_T1IF_POSITION                      0x00000003
#define _IFS0_T1IF_MASK                          0x00000008
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_CCP3IF_POSITION                    0x00000005
#define _IFS0_CCP3IF_MASK                        0x00000020
#define _IFS0_CCP3IF_LENGTH                      0x00000001

#define _IFS0_CCP4IF_POSITION                    0x00000006
#define _IFS0_CCP4IF_MASK                        0x00000040
#define _IFS0_CCP4IF_LENGTH                      0x00000001

#define _IFS0_CCT1IF_POSITION                    0x00000007
#define _IFS0_CCT1IF_MASK                        0x00000080
#define _IFS0_CCT1IF_LENGTH                      0x00000001

#define _IFS0_CCT2IF_POSITION                    0x00000008
#define _IFS0_CCT2IF_MASK                        0x00000100
#define _IFS0_CCT2IF_LENGTH                      0x00000001

#define _IFS0_U1RXIF_POSITION                    0x0000000B
#define _IFS0_U1RXIF_MASK                        0x00000800
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x0000000C
#define _IFS0_U1TXIF_MASK                        0x00001000
#define _IFS0_U1TXIF_LENGTH                      0x00000001

#define _IFS0_AD1IF_POSITION                     0x0000000D
#define _IFS0_AD1IF_MASK                         0x00002000
#define _IFS0_AD1IF_LENGTH                       0x00000001

#define _IFS0_NVMIF_POSITION                     0x0000000F
#define _IFS0_NVMIF_MASK                         0x00008000
#define _IFS0_NVMIF_LENGTH                       0x00000001

#define _IFS1_SSP1IF_POSITION                    0x00000000
#define _IFS1_SSP1IF_MASK                        0x00000001
#define _IFS1_SSP1IF_LENGTH                      0x00000001

#define _IFS1_BCL1IF_POSITION                    0x00000001
#define _IFS1_BCL1IF_MASK                        0x00000002
#define _IFS1_BCL1IF_LENGTH                      0x00000001

#define _IFS1_CMIF_POSITION                      0x00000002
#define _IFS1_CMIF_MASK                          0x00000004
#define _IFS1_CMIF_LENGTH                        0x00000001

#define _IFS1_CNIF_POSITION                      0x00000003
#define _IFS1_CNIF_MASK                          0x00000008
#define _IFS1_CNIF_LENGTH                        0x00000001

#define _IFS1_INT1IF_POSITION                    0x00000004
#define _IFS1_INT1IF_MASK                        0x00000010
#define _IFS1_INT1IF_LENGTH                      0x00000001

#define _IFS1_CCP5IF_POSITION                    0x00000006
#define _IFS1_CCP5IF_MASK                        0x00000040
#define _IFS1_CCP5IF_LENGTH                      0x00000001

#define _IFS1_CCT3IF_POSITION                    0x0000000B
#define _IFS1_CCT3IF_MASK                        0x00000800
#define _IFS1_CCT3IF_LENGTH                      0x00000001

#define _IFS1_CCT4IF_POSITION                    0x0000000C
#define _IFS1_CCT4IF_MASK                        0x00001000
#define _IFS1_CCT4IF_LENGTH                      0x00000001

#define _IFS1_INT2IF_POSITION                    0x0000000D
#define _IFS1_INT2IF_MASK                        0x00002000
#define _IFS1_INT2IF_LENGTH                      0x00000001

#define _IFS1_U2RXIF_POSITION                    0x0000000E
#define _IFS1_U2RXIF_MASK                        0x00004000
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x0000000F
#define _IFS1_U2TXIF_MASK                        0x00008000
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS2_CCT5IF_POSITION                    0x00000009
#define _IFS2_CCT5IF_MASK                        0x00000200
#define _IFS2_CCT5IF_LENGTH                      0x00000001

#define _IFS3_SSP2IF_POSITION                    0x00000001
#define _IFS3_SSP2IF_MASK                        0x00000002
#define _IFS3_SSP2IF_LENGTH                      0x00000001

#define _IFS3_BCL2IF_POSITION                    0x00000002
#define _IFS3_BCL2IF_MASK                        0x00000004
#define _IFS3_BCL2IF_LENGTH                      0x00000001

#define _IFS3_RTCIF_POSITION                     0x0000000E
#define _IFS3_RTCIF_MASK                         0x00004000
#define _IFS3_RTCIF_LENGTH                       0x00000001

#define _IFS4_U1ERIF_POSITION                    0x00000001
#define _IFS4_U1ERIF_MASK                        0x00000002
#define _IFS4_U1ERIF_LENGTH                      0x00000001

#define _IFS4_U2ERIF_POSITION                    0x00000002
#define _IFS4_U2ERIF_MASK                        0x00000004
#define _IFS4_U2ERIF_LENGTH                      0x00000001

